# типы данных в Python 
# 1. NoneType - Ничего, пустота- >None
# 2. Boolean - Истина или ложь -> True/False 
# 3. str() - Строки - > 'hello world',"hello world"
# 4. Числовые типы данных : 
# a. integer - int() - Целое число (-1, -2, 0, 1)
# b. float() - Число в плавающей точкой (-1.2,10.15,2.7,)
# c. complex() - Комплексные числа (3+5i6)
# 5.Списовые типы данных: 
# a. list(масив/список)-> [1, 2, 3, None, 'hello', True, False, [1, 2, 3]]
# b. tuple(кортеж) -> (1, 2, 3, 4, None)
# c. range(последовательность) -> range (1, 10)
# 6. set() -> Множества
# 7. dict(словари) -> содержит данные виде ключа и значений -> {1: 'One', 2: 'Two'}
# ****************************************************************************************************************8
# Mutable(изменяемые типы данных) 
# 1. list
# 2. set
# 3. dict


# Immitable(неизменяемые типы данных)

# 1. NoneType
# 2. boolean
# 3. int float complex
# 4. str
# 5. range
# 6. tuple
# 7. frozenset 
# ****************************************************************************************************************8

# ''' стандартный вывод данных'''

# """в пайтоне для вывода данных в терминал используется встроенная функция print()"""
# print('Hello world')
# print('dfghj')


# '''Стандартный ввод данных через терминал используется функция input()'''

# a = input('Ведите число: ')
# print ('В а хранится: ')
# print(a)
# print(input('Ведите свое имя: '))
a = input ('Ведите число: ')
print('В а хранится : ')
