# 10. Даны две переменные s1 = "America" и s2 = "Japan".  Выведите новую строку в который будут записаны первый, средний и последний элемент двух переменных.  Необходимо использовать срезы.
# Вывод: "AJrpan".
# s1 = 'america'
# s2 = 'japan'
# first_s1 = s1[0]
# first_s2 = s2[0]
# middle_s1 = s1[len(s1) //2]
# middle_s2 = s2[len(s2) // 2]
# last_s1 = s1[-1]
# last_s2 = s2[-1]
# res = first_s1 + first_s2 + middle_s1 + middle_s2 + last_s1 + last_s2
# print(res)


# dano -> [1-100]
# число / 3 -> fu
# число / 5 -> da
# число /3,/5 -> fuda
# вывод: 3 fu
#        5 da
#        15 fuda
# for number in range(1, 101):
#     # print(number)
#     if number % 3 == 0 and number% 5 == 0:
#         print(f'{number} fuda')
#     elif number % 3 == 0:
#         print(f'{number} fu')
#     elif number % 5 == 0:
#         print(f'{number} da')
    # elif number % 3 == 0 and number% 5 == 0:
    #     print(f'{number} fuda')














